// Наступна функція повертає true, якщо параметр age більший за 18.
// Інакше вона запитує підтвердження через confirm і повертає його результат:

// function checkAge(age) {
//   if (age > 18) {
//     return true;
//   } else {
//     return confirm('Батьки дозволили?');
//   }
// }
// Перепишіть функцію, щоб вона робила теж саме, але без if і в один рядок.
// Зробіть два варіанти функції checkAge:

// Використовуючи оператор ?
// Використовуючи оператор АБО ||

// function checkAge(age){
//     return (age>18) ? true : confirm('Бфтьки дозволили?')
// }
//  const checkAge = age => (age >18) ? true : confirm('Бфтьки дозволили?');
//  const checkAge = age => (age >18) ||  confirm('Бфтьки дозволили?');

// ---------------------------------------------------------------------------------------
// Напишіть функцію min(a, b), яка повертає менше з двох чисел a та b.
// function min (a,b){
//     if (a<b){
//         return a
//     }else{
//         return b
//     }
// }
//  const min = (a,b)=>(a<b) ? a :b;
//   console.log(min(12,5))